			<h1>
				<a id="title" href="./">Cліди прямої</a>
			</h1>
			<p>
				<b>Сліди прямої</b> - це така графічна робота, якщо не помиляюсь вона присутня в другого курсу в КС та інших спеціальностей які вивчають курс комп'ютерної графіки в <a href="http://ifkepnung.if.ua/" target="_blank">Коледжі Електронних Приладів. </a>
			</p>
			<p>
				Суть проста - тобі дають по три координати двох точок. A і B, або C і D.
				В просторі ці дві точки можна з'єднати прямою, пряма рано чи пізно перетне координатні площини.
				Там де вона перетне площини і утворяться сліди прямої.
				Точка перетину якоїсь однієї площини (тобто слід) дасть дві проекції на інші дві площини.
				Точка перетину фронтальної площини <i>F</i> (слід <i>F</i>) дасть проекції цього сліда на інші дві площини (<i>H</i> та <i>P</i>),
				відповідно слід <i>P</i> - на площини <i>H</i> та <i>F</i>, слід <i>H</i> - на площини <i>P</i> та <i>F</i>.
			</p>
			<p>
				Алгоритм побудови реалізований на <b>php</b> з використанням бібліотеки <b>gd-lib</b> для графічних побудов.
			</p>
			<p>
				На сторінці присутні два рисунки: зліва - аксенометрія, зправа - епюр.
				Ви можете їх відкрити як зображення та зберегти.
			</p>
			<p class="img"><img src="img/line-traces.jpg"></p>
			<p>
				По дефолту кординати точок приймаються такі <i>А(90;75;10)</i> та <i>B(30;50;45)</i>. <b>розмір</b> - розмір зображення при умові що масштаб = 1. <b>масштаб</b> - зміна "віддаленості" зображення. Якщо рисунок виходить великим і не вміщається на зображенні, можна збільшити масштаб і скрипт віддалить рисунок. Розміри зображення дорівнюють масштабу помноженому на вказаний розмір.
			</p>
			<p>
				На кожному із зображень для зручності виведено координати точок та натуральні розміри рисунка <i>(beta)</i>.
				Оптимальний варіант для побудови слідів - розмір=400, масштаб=1.5.
				При цих розмірах натуральні розміри переважно показуються правильно.
				При великих та гігантських розмірах натуральні розміри можуть бути неправдиві.
				Натуральні розміри вказані в сантиметрах
			</p>
			<p style="text-indent: 0; margin-left: 3%;">
				1 - ширина<br/>
				2 - зправа від центру координат<br/>
				3 - загальні<br/>
				4 - висота<br/>
				5 - зліва від центру координат<br/>
			</p>
			<p class="img">
				<img src="img/sizes.jpg">
			</p>

			<p>Вихідний код (початку 2012 року) - <a href="https://github.com/flashbag/line-traces">https://github.com/flashbag/line-traces</a></p>
			<p>З.І. За іронією долі я, коли був на другому курсі, цю роботу не здав :)</p>

			<p><a id="back2" href="http://works.flashbag.if.ua/line-traces" ><small>&laquo; назад до побудови</small></a>